app/views/events/_event.html.erb

SELECT "events".* FROM "events" WHERE (date < ('2020-07-22') )
---
 <div>
   <% Event.past.each do |event |  %>