app/views/events/_future_events.html.erb

SELECT  "events".* FROM "events" WHERE (date >= ('2020-07-22') ) ORDER BY "events"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
<div>
  <% Event.future.find_each do |event |  %>