app/views/events/_past_event.html.erb

SELECT  "events".* FROM "events" WHERE (date < ('2020-07-23') ) ORDER BY "events"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
 <div>
   <% Event.past.find_each do |event |  %>