app/views/events/index.html.erb

SELECT "events".* FROM "events"
SELECT COUNT(*) FROM "events" WHERE (date < ('2020-07-21') )
---

<% if Event.past.count.zero? %>

SELECT "events".* FROM "events" WHERE (date < ('2020-07-21') )
---
<div>
    <% Event.past.each do |event |  %>

SELECT "events".* FROM "events" WHERE (date >= ('2020-07-22') )
SELECT COUNT(*) FROM "events" WHERE (date >= ('2020-07-21') )
---
<h1>Upcoming Events</h1>
<% if Event.future.count.zero?  %>

SELECT "events".* FROM "events" WHERE (date >= ('2020-07-21') )
---
<div>
    <% Event.future.each do |event |  %>