app/views/invitations/_form.html.erb

<%= f.label :username, 'Your username:' %>
<%= f.select :user_id, User.all.collect { |p| [ p.username, p.id ] }, include_blank: true %>
---
SELECT "users".* FROM "users"