app/helpers/events_helper.rb

  def past_events
    if Event.past.all.size.zero?
---
SELECT COUNT(*) FROM "events" WHERE (date < ('2020-07-22') )

  def upcoming_events
    if Event.future.all.size.zero?
---
SELECT COUNT(*) FROM "events" WHERE (date >= ('2020-07-22') )