app/helpers/events_helper.rb

  def creator
    render 'invitations/form', event: @event, not_invited: User.all - @event.attendees if @event.creator == current_user
---
SELECT "users".* FROM "users"