app/helpers/users_helper.rb

  def print_created_events
    render 'created_events', user: @user, created_events: @created_events unless @created_events.all.size.zero?
---
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = ?  [["user_id", 16]]