app/controllers/events_controller.rb

  def create
    @event = current_user.events.build(event_params)
    if @event.save
---
INSERT INTO "events" ("date", "created_at", "updated_at", "creator_id", "title", "description") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2020-07-07"], ["created_at", "2020-07-24 08:30:05.718577"], ["updated_at", "2020-07-24 08:30:05.718577"], ["creator_id", 35], ["title", "Birtday party"], ["description", ""]]

  def index
    @events = Event.all
---
SELECT "events".* FROM "events" WHERE (date >= ('2020-07-21') )

  def show
    @event = Event.find(params[:id])
    @users = User.all
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users"