app/controllers/invitations_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def create
    event = Event.find( params[:event_id] )
    user = User.find( params[:user_id] )