app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "hasan"], ["created_at", "2020-07-22 15:24:07.920671"], ["updated_at", "2020-07-22 15:24:07.920671"]]

  def show
    @user = User.find(params[:id])
    return unless @user

    @created_events = @user.events
    @previous_events = @user.attended_event.where('date < (?) ', Date.today)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT "events".* FROM "events" INNER JOIN "invitations" ON "events"."id" = "invitations"."event_id" WHERE "invitations"."user_id" = ? AND (date >= ('2020-07-21'))  [["user_id", 16]]